[
  {
    "name":"LRN+-+The+Future+of+Design+in+Educational+Technology",
    "title":"LRN - The Future of Design in Educational Technology",
    "subtitle": "<lrn><lrndesign><lrnsys><oer><hax>",
    "authors": ["Bryan Ollendyke"],
    "date": "April 13, 2017",
    "category":"blog",
    "tags":["webcomponents", "polymer", "design"],
    "videos": ["https://youtu.be/CRcXQRx_8tQ", "https://youtu.be/J2NistNNaHI", "https://youtu.be/B0dNaVIvjSE","https://youtu.be/CLpEsEjvf18","https://youtu.be/8UftueSZP8w"],
    "description":"<p>If you&#39;ve been watching twitter the last few months now, you&#39;d notice a few things with regards to elmsln:</p><ol><li>We tweet back and forth with @oerschema and&nbsp;@lrnwebcomponents accounts a lot</li><li>@hey__mp, @mmilutinovic13 and I have been talking non-stop with people about #polymer and #webcomponents</li><li>We haven&#39;t been talking a lot about ELMS:LN proper</li></ol><p>So what&#39;s happening? Have we moved onto a new project and let ELMS:LN hang out?&nbsp;NO!</p><p>At our DrupalcampNJ sprint, we started to toy with the idea of how we go about building HAX, a concept we&#39;ve discussed during the past 2 drupalcampNJ&#39;s now and each time we try to work on it hit a wall. A phrase came up though that completely changed our thinking and set me to work on code. That phrase was &quot;The front end design should be driving the backend API, not the other way around&quot;.</p><p>Forever, we&#39;ve gone through a process like so:</p><ol><li>Make a design / mock up of an idea</li><li>See what we&#39;ve done on the backend</li><li>Start to chunk the mock up into parts that match what the backend has dictated</li><li>Get a design that is MOSTLY the same but not the same as the original</li></ol><p>We needed a technology to solve this and so many other architectural front-end design issues we&#39;ve faced over the years. We want to remain agile with such a large platform / scope and after building the Studio tool in Angular, realized that while it provides a better user experience, the developer experience was slow, not reusable, and hard to reproduce. In other words, unsustainable.</p><p>The rise of Webcomponent architecture</p><p>I&#39;ve been blogging on other platforms / producing youtube videos about webcomponents so you can check the links for them but the gist is that in 2014, google proposed to the W3C this idea of allowing developers a way of defining their own html tags. The specification is actually 4 specifications working together and has been an idea that&#39;s slowly been growing over the last 3 years.</p><p>So why are we jumping on this now?</p><p>Well, we&#39;re tired of reinventing the wheel and webcomponents offer the same level of code modularity on the front end that Drupal has afforded us on the backend. Polymer, a library we use to build our webcomponents, also has provided a way of filling in the gaps in browser support. From the videos below I hope you start to see just how revolutionary these workflows are.</p><p>I encourage you to watch / read through the postings below on how to get more involved in the LRN project and expect to see it implemented in the core of ELMSLN soon. This truly will unlock the ability to do well communicated instructional design oriented custom &quot;html&quot; elements across solutions (elmsln, drupal or otherwise). ELMS:LN will have 1st party support for LRN, not the other way around, to ensure maximum flexibility and adoption by the educational technology community at large.</p>",
    "image":"/data/images/blog/future_of_edtech.jpg",
    "largeImage":"/data/images/blog/future_of_edtech.jpg"
  },
  {
    "name":"Data+Visualization+Sneak+Peak",
    "title":"Data Visualization Sneak Peak",
    "subtitle": "data viz",
    "authors": ["Bryan Ollendyke"],
    "date": "February 23, 2017",
    "category":"blog",
    "tags":["data visualization", "xapi", "0.7.2"],
    "videos": ["https://youtu.be/KTvxJ2TVa3s"],
    "description":"<p>This video shows our latest and greatest from the 0.8.x branch of ELMS:LN, where our next release will be cut from. It also has a preview of our Next UI iteration (still in an experimental branch). In this video I talk through our data dashboards and visualizations that we can now play with to make meaning of all that xAPI data we&#39;ve been collecting. You can filter, sort, and change pivots to H5P / answer data. This is also shown in different locations like media, user centric, content and CIS as part of the facets that get mixed into the same dashboard when displayed in different contexts. This is important because we can use the same dashboard to show a user their own personal data when they want to see what they&#39;ve done, but also show a program manager what people are up to in their program, or for faculty to see how students did on that last self-check activity.</p>",
    "image":"/data/images/blog/dataviz.jpg",
    "largeImage":"/data/images/blog/dataviz.jpg"
  },
  {
    "name":"Bringing+Google+Home+to+ELMSLN",
    "title":"Bringing Google Home to ELMS:LN",
    "subtitle": "ok elms",
    "authors": ["Bryan Ollendyke"],
    "date": "February 14, 2017",
    "category":"blog",
    "tags":["accessibility", "a11y", "voice"],
    "videos": ["https://youtu.be/XcEIa00C1yI", "https://youtu.be/-cYm6FiNpT0"],
    "description":"<p><em>originally posted on Drupal @ Penn State</em></p><p>I&#39;ve dreamed of a day when systems start to work like the home automation and listening (NSA Spying...) devices that people are inviting into their home. &quot;Robots&quot; that listen to trigger words and act on commands are very exciting. What&#39;s most interesting to me in trying to build such systems is,... they really aren&#39;t that hard any more. Why?</p><p>Well, the semantic web is what&#39;s delivering the things for Siri, Google and Alexa to say on the other end. When you ask about something and it checks wikipedia THAT IS AMAZING.... but not really that difficult. The human voice is being continuously mapped and improved upon in accuracy daily as a result of people using things like Google Voice for years (where you basically give them your voice as data pieces in order to improve their speech engines).</p><p>So I said, well, I&#39;d like to play with these things. I&#39;ve written about Voicecommander in the past but it was mostly proof of concept. Today I&#39;d like to announce the release of VoiceCommander 2.0&nbsp;<strong>with built in support to do the &quot;Ok Google&quot; style wikipedia voice querying!</strong></p><p>To do this, you&#39;ll need a few things:</p><ul><li>Voicecommander 2.0 (https://www.drupal.org/project/voicecommander)</li><li>Annyang library in the sites/all/libraries folder (voice commander project has drush command for this / documentation)</li><li>Puzzler module -&nbsp;https://www.drupal.org/project/puzzler</li></ul><p>Enable the voicecommander_whatis module, tweak the voicecommander settings to your liking and then you&#39;ll be able to build things like in this demo. The 1st video is a quick 1 minute of a voice based navigational system (this is how we do it in ELMSLN). The second is me talking through what&#39;s involved, what&#39;s actually happening, as well as A/B comparing different library configuration settings and how they relate to accuacy downstream.</p>",
    "image":"/data/images/blog/ok_elms.jpg",
    "largeImage":"/data/images/blog/ok_elms.jpg"
  },
  {
    "name":"070+preview",
    "title":"0.7.0 Preview",
    "subtitle": "we are all makers",
    "authors": ["Bryan Ollendyke", "Michael Potter"],
    "date": "January 25, 2017",
    "category":"blog",
    "tags":["makers", "0.7.0"],
    "videos": ["https://youtu.be/03WdqcZsaKI?list=PLJQupiji7J5eiJU_0bMOufgUoIDYW3jZF"],
    "description":"<p>The core ELMS:LN team has been hard at work on our studio submission application the last month. In addition to getting the semester started for PSU core developers, there&#39;s been a lot of improvements in usability and stability of the platform as awhole. It&#39;s been awhile since we showcased the state of everything and so, to kick off our ELMS Makers web-series, we decided to give an overview of the state of.. well... everything.</p><p>What follows is a random walk through the platform as it stands today, descriptions from Michael Potter (Front-end Lead) and Bryan Ollendyke (Project Lead) as to where things are heading in the next few months, and some glimpses of the rather insane accessibility enhancements in the platform (like continuous listening support).</p><p>&nbsp;</p><p>This is the most comprehensive tour of the platform, what it does, and what it can do <strong>while showing real live courses, data sets and usability patterns experienced in production environments.&nbsp;</strong>Things are looking bright, but the&nbsp;best is yet to come!</p><p>&nbsp;</p><p><strong>UPDATE</strong>: <a href=\"https://github.com/elmsln/elmsln/pull/1803\">WVU just had their first contribution accepted to the platform</a>!</p><p><strong>UPDATE 2</strong>: 0.7.0 has been released!</p>",
    "image":"/data/images/blog/070_release.jpg",
    "largeImage":"/data/images/blog/070_release.jpg"
  },
  {
    "name":"Installing+ELMSLN+on+AWS+and+Configuring+xAPI+and+H5P",
    "title":"Installing ELMS:LN on AWS and Configuring xAPI and H5P",
    "subtitle": "community power",
    "authors": ["David Fusco"],
    "date": "November 23, 2016",
    "category":"blog",
    "tags":["community", "xAPI","0.6.0", "AWS"],
    "videos": ["https://youtu.be/03WdqcZsaKI?list=PLJQupiji7J5eiJU_0bMOufgUoIDYW3jZF"],
    "description":"<p><a href=\"http://drdavefusco.com/installing-elmsln-on-aws-and-configuring-xapi-and-h5p/\">Original Post</a></p><p>We wanted to point out a great post by our newest community member David Fusco. David is a faculty member in the College of Information Sciences &amp; Technology at Penn State and recently got ELMSLN deployed on Amazon, then hooked it up to Learning Locker.</p>",
    "image":"/data/images/blog/",
    "largeImage":"/data/images/blog/"
  },
  {
    "name":"050+Pumpkin+Released",
    "title":"0.5.0 Pumpkin Released",
    "subtitle": "#pumpkin",
    "authors": ["Bryan Ollendyke"],
    "date": "November 14, 2016",
    "category":"blog",
    "tags":["0.5.x", "release","screencast"],
    "videos": ["https://youtu.be/rCiPJG8AhVg"],
    "description":"<p>Another release, another big release. This update has massive performance, accessibility and usability enhancements. As with other releases, we&#39;re upping our game as far as functionality included out of the box as well as what&#39;s supported through minor additions.</p><p>There&#39;s built in support for leaflet-based&nbsp;maps, xAPI visualization and tracking, read time statistical generation is now stable, PDF / Print mode printing, more refined media and testing work. The usability improvements associated with color and design now give greater context of where people are and what they are doing. MaterializeCSS has also been fully implemented, replacing our 2 year long run with Zurb Foundation / hacky / some materialize code. Materialize nets us a larger design community and really clean visualization / design patterns to start from.</p><p>There&#39;s also a lot of work under the hood in stability and improvements people won&#39;t notice but that put us on better footing going forward, including Ubuntu 16 with PHP 7, MariaDB, and HTTP2 support for the fastest page delivery currently possible by web-stacks. There&#39;s also some experimental work for Angular 2.0 apps in the 2.x version of the Studio. The next release will focus more on getting this and other Angular experiments graduated to full usage. This release has the most issues stomped and functionality added since the project initially got a 0.0.0 release marker, clocking in at 160 issues (we try to shoot for 100 per release).</p><p>Attached is a video walking through some of the latest enhancements.</p>",
    "image":"/data/images/blog/greenhex.jpg",
    "largeImage":"/data/images/blog/greenhex.jpg"
  },
  {
    "name":"Low+Vision+Accessibility+Simulator",
    "title":"Low Vision Accessibility Simulator",
    "subtitle": "lowvision",
    "authors": ["Bryan Ollendyke"],
    "date": "October 10, 2016",
    "category":"blog",
    "tags":["accessibility"],
    "videos": ["https://youtu.be/74t0Rq5Ti4w"],
    "description":"<p>The ELMS:LN team is dedicated to issues of accessibility. As I've advocated before though, we have to think of the world beyond \"Just it's accessible\". We need to strive to create empathy. This quick video shows work towards implementation of simulators that help with meeting requirements of the W3C's specification for visual impairments.</p>",
    "image":"/data/images/blog/lowvision.jpg",
    "largeImage":"/data/images/blog/lowvision.jpg"
  },
  {
    "name":"New+ELMSLN+Intro+Video",
    "title":"New ELMS:LN Intro Video",
    "subtitle": "welcome to elmsln",
    "authors": ["Bryan Ollendyke"],
    "date": "October 10, 2016",
    "category":"blog",
    "tags":["presentation"],
    "videos": ["https://youtu.be/mmOId1IxpNE"],
    "description":"<p>It's been almost a year since our video explaining the concept had been updated so I decided to shoot a website specific video. This hopefully gives the best overview of the platform in the shortest amount of time (7:30 minutes). I've included some of the latest screenshots and talk about LMS design, what this enables you to do and what you can build with it (shown visually). Enjoy!</p>",
    "image":"/data/images/blog/color_snowflake.jpg",
    "largeImage":"/data/images/blog/color_snowflake.jpg"
  },
  {
    "name":"Learner+Centric+Accessible+Media+Delivery",
    "title":"Learner Centric Accessible Media Delivery",
    "subtitle": "personalize",
    "authors": ["Bryan Ollendyke"],
    "date": "October 7, 2016",
    "category":"blog",
    "tags":["accessibility", "0.5.x", "elmsmedia"],
    "videos": ["https://youtu.be/SPbtL7nh0rs"],
    "description":"<p>We&#39;ve been making great strides in usability and design in the upcoming release of ELMSLN (0.5.x). One dream of mine has always been to contextually rewrite / deliver content to users based on their needs. Doing so, without the constant conversations and checking of material by accessibility experts coordinating with those that produced courses. Well, today a glimpse of that dream is realized with the inclusion of an &quot;Accessible fallback&quot; field for H5P and SVG media from the elmsmedia system.</p><p>With this option, you&#39;ll be able to utilize a potentially inaccessible H5P type while easily providing support for fallback text and media that accomplishes the same thing in a more accessible way.</p><p>For example:</p><ul><li>You want users to have a Pop-up video style experience in a 30 minute lecture</li><li>You use the H5P Interactive Video content type to produce that experience, stopping the video to ask questions along the way (tracked via xAPI)</li><li>Oh no, that&#39;s not accessible</li></ul><p>Historically, this is where things shut down. There&#39;s no decision tree for using this, it just doesn&#39;t happen because of legal and ethical concerns about excluding screenreader and other imparements from the interaction.</p><p>Now though, you&#39;ll be able to push ahead with your video that has questions asked (without leaving people behind), provided you utilize the accessible fallback type.</p><p>The video below talks throught his enhancement by demonstrating its capabilities with the above use-case.</p>",
    "image":"/data/images/blog/personalize.jpg",
    "largeImage":"/data/images/blog/personalize.jpg"
  },
  {
    "name":"Materialize+All+The+Things",
    "title":"Materialize All the Things!",
    "subtitle": "#materializecss",
    "authors": ["Bryan Ollendyke"],
    "date": "September 29, 2016",
    "category":"blog",
    "tags":["materialize", "accessibility", "usability", "ux", "style guide", "design"],
    "videos": ["https://youtu.be/-Gin_gLyMLo"],
    "description":"<p>Open source has a huge problem (typically). It&#39;s built by lots of people focusing so heavily on the acts of doing and contribution of building blocks that no one stops and makes it all look and work seamlessly. This leads to tons of FOSS solutions that look terrible (closed systems usually are too when built by many)&nbsp;but that do amazing things. Well, no one cares about your project no matter what it does unless it looks awesome.</p><p>I lump this under the umbrella of accessibility. If we aren&#39;t getting people to install and use solutions that can be free (yet they still pay millions for) then we have an access and accessibility problem. So, I finally got out of my comfort zone of module development and dug in deep to intentionally redoing our design. As in, more then just <a href=\"http://twitter.com/_mike_collins\">@_mike_collins</a> providing a mock up and then me attempting to make it work.</p><p>No, the ELMS:LN user experience is now entirely driven by <a href=\"http://materializecss.com/\">MaterializeCSS</a>, a FOSS project that&#39;s pretty like <a href=\"http://design.google.com/\">Google&#39;s Material Design</a> standard but easy to use like Twitter Bootstrap. With Materialize we&#39;ve been able to improve usability, consistency and accessibility of our systems. There&#39;s also an increased transparency of design because any materialize design component / library will &quot;JustWork&quot; visually.</p><p>We then took Materialize a step further, getting pull requests accepted (others pending) to improve accessibility of their awesome project. There&#39;s also additional accessibility enhancements that go beyond what&#39;s possible in the current Materialize library, such as accessible (WCAG 2.0 AAA conformance) on font color contrast, while still sticking to within the design ideals of the library (.accessible-yellow-text &nbsp;.blue-border light-green-outline&nbsp;for example).</p><p>Check out the video below for my tour through what&#39;s coming in the next version of ELMSLN.</p>",
    "image":"/data/images/blog/materialize.jpg",
    "largeImage":"/data/images/blog/materialize.jpg"
  },
  {
    "name":"Innovating+Beyond+Just+Its+Acessible",
    "title":"Innovating Beyond 'It's Accessible'",
    "subtitle": "#a11y",
    "authors": ["Bryan Ollendyke"],
    "date": "August 10, 2016",
    "category":"blog",
    "tags":["a11y", "accessibility", "presentation"],
    "videos": ["https://youtu.be/TCh6RMpn820"],
    "description":"<p>This is a recording of a presentation I gave at an on campus event recently about Accessibility. I am often a provocator when it comes to my care about accessibility; meaning I always say I don&#39;t want people to care about accessibility. It&#39;s not because I want others to lack empathy, it&#39;s because our systems in an ideal world would &quot;Just Work&quot; for everyone.</p><p>Sadly, we lack access to all of all abilities and so we&#39;re here with a world in need of improving access. This is where I situate accessibility; as access. We need to improve access to all things and all people through new and different ways then simply aria text.</p><p>This video shows things like Speedreader, Open dyslexic font, Voice and keyboard (in browser) based systems, HAX, A11y Drupal module and more! Expect to see these as well as many other exciting new accessibility features in the 0.4.x release of ELMS:LN which should drop in the next week or two.</p>",
    "image":"/data/images/blog/innovate_accessible.jpg",
    "largeImage":"/data/images/blog/innovate_accessible.jpg"
  },
  {
    "name":"XAPI+Hypothesis+Context+Value",
    "title":"XAPI Hypothesis Context Value",
    "subtitle": "hypothesis",
    "authors": ["Bryan Ollendyke"],
    "date": "August 5, 2016",
    "category":"blog",
    "tags":["xapi"],
    "videos": ["https://youtu.be/E9VSDcl5vUM"],
    "description":"<p>This video describes how a hypothesis tag can be added to shortcodes that contain xAPI emitting activities (like H5P) in order to help provide additional context to where the activity takes place. In the video I demonstrate the idea of using a standard question-set spread across a course to measure student reported quality of activities.</p><p>I then take the same question and apply it in another context and add the hypothesis tag to the shortcode, which then will append that to the xAPI&nbsp;extensions property of the statement. These extensions can then be used later to filter and analyze responses as a whole as well as by filtering based on our hypothesis.</p><p>This could also be used to tag &quot;new&quot; videos throughout the course or ones that are experimental to see if they get higher ratings during a pilot offering or revision of material. It could also be used as more of a tagging system to help when building visualizations.</p>",
    "image":"/data/images/blog/camera.jpg",
    "largeImage":"/data/images/blog/camera.jpg"
  },
  {
    "name":"HAX++Voicecommand+Prototype",
    "title":"HAX + Voicecommand Prototype",
    "subtitle": "headless",
    "authors": ["Bryan Ollendyke"],
    "date": "July 21, 2016",
    "category":"blog",
    "tags":["HAX","voice","2020"],
    "videos": ["https://youtu.be/Yi1DyZC5fVk"],
    "description":"<p>As part of the 2020 roadmap we&#39;ve got two different ideas which I&#39;m showing playing together. The first is Headless Authoring eXperience (HAX) which is an idea to use the DOM and some simple buttons to create complex layouts and HTML. Think WYSIWYG but what your actually looking for and completely static.</p><p>The second part is our voice command / annyang based system which I&#39;ve abstracted from Drupal (as well) and then merged it into the work I&#39;ve done decoupling HAX. This took about an hour to get wired up to the current state of HAX which speaks to how easy these things are getting to merge.</p>",
    "image":"/data/images/blog/headless.jpg",
    "largeImage":"/data/images/blog/headless.jpg"
  },
  {
    "name":"Lullabot+Podcast+Interview",
    "title":"Lullabot Podcast Interview",
    "subtitle": "bots",
    "authors": ["Bryan Ollendyke", "Michael Potter"],
    "date": "July 18, 2016",
    "category":"blog",
    "tags":["interview"],
    "videos": [],
    "description":"<p>Michael and Bryan were recently asked to talk ELMS Learning network on the Lullabot podcast. Lullabot is a popular, long time drupal vendor. The pair field questions about what problems we&#39;re trying to solve, offer examples of ways we&#39;ve been able to tackle them with elmsln and talk about what we&#39;re excited for down the road.</p>",
    "image":"/data/images/blog/robots.jpg",
    "largeImage":"/data/images/blog/robots.jpg"
  },
  {
    "name":"XAPI++DRUPAL++H5P+to+Track+User+Feedback",
    "title":"XAPI + DRUPAL + H5P to Track User Feedback",
    "subtitle": "xapi feedback",
    "authors": ["Bryan Ollendyke", "Michael Potter"],
    "date": "July 12, 2016",
    "category":"blog",
    "tags":["XAPI", "learning locker", "H5P"],
    "videos": ["https://youtu.be/VZ51_nLhICg"],
    "description":"<p>This originally appeared on Drupal.psu.edu; check the links section for more of a write up</p>",
    "image":"/data/images/blog/Puzzle.jpg",
    "largeImage":"/data/images/blog/Puzzle.jpg"
  },
  {
    "name":"Voice+Based+Usablity",
    "title":"Voice Based Usablity",
    "subtitle": "talk2me",
    "authors": ["Bryan Ollendyke"],
    "date": "July 6, 2016",
    "category":"blog",
    "tags":["voice", "accessibility", "ux", "2020"],
    "videos": ["https://youtu.be/ycKszCBLRZg"],
    "description":"<p>I&#39;ve been tinkering with spoken interfaces if you&#39;ve been following me on twitter. In 2015, Michael Collins (lead faculty) and I envisioned a system (in elms) that you could talk to and have it know what to do. Not AI persay, but a really&nbsp;simplistic agency for the system that understood enough to make things easier for you. The foundational work for that is in creating a spoken interface. This is something core in elmsln (that works in drupal in general) and has seen a lot of usability refinement over the last two weeks of playing.</p><p>This video shows the current state of the integration and is a window into things to come as these technologies stabilize, get easier to work with and we integrate / get additional user feedback about their use. In this video I&#39;ve turned on continual listening mode (which is not the default setting) as to allow for a seamless experience without having to press any buttons. It is our hope that down the road this option would be available for anyone to enable (right now it&#39;s just admins that can go handsfree, staff can use the key command and by default no one else has these options... yet).</p><p>From here, getting the system to speak back to the user, adding custom commands, and improving usability of this mini-form of agency are not terribly difficult.</p>",
    "image":"/data/images/blog/robots2.jpg",
    "largeImage":"/data/images/blog/robots2.jpg"
  },
  {
    "name":"Authoring+and+Performance+Enhancements",
    "title":"Authoring and Performance Enhancements",
    "subtitle": "hax in sight...",
    "authors": ["Bryan Ollendyke"],
    "date": "June 7, 2016",
    "category":"blog",
    "tags":["enhancement", "usability"],
    "videos": ["https://youtu.be/ymkfJ42ouiY"],
    "description":"<p>This video shows a pull request being processed right now which will add in contextual menus for all remotely loaded material. This streamlines the workflow of modifying and working with media, interactive material and any item embedded in any other item. This JustWorks now for any shortcode anywhere in the system. It&#39;s still early and needs more testing (hence pull request) but wanted to show the progress on this workflow as it&#39;s a biggy.</p>",
    "image":"/data/images/blog/scale.jpg",
    "largeImage":"/data/images/blog/scale.jpg"
  },
  {
    "name":"Working+in+Learning+Objects",
    "title":"Working in Learning Objects",
    "subtitle": "lor",
    "authors": ["Bryan Ollendyke"],
    "date": "April 13, 2016",
    "category":"blog",
    "tags":["lor", "collaboration", "automation"],
    "videos": ["https://youtu.be/Dgttw2ulToA", "https://youtu.be/K61eW_Orzu8"],
    "description":"<p>Innovate, Comply, and now a Learning Object Repository. Not bad for one weeks work* (*I don&#39;t consider automation to be work). In the videos below I walk through the process of ingesting a Drupal 7 site produced as a stand alone. The site in question is an impressive learning object repository being worked on at Michigan&#39;s&nbsp;Virtual University. In the first video, I go from having a database and file structure of a site all the way to hacking elmsln&#39;s innovate tool in order to make it appear to be in elmsln via it&#39;s being inside the architecture. I also offer them advice along the way about how I may have structured the site differently as far as the Drupal setup and discover some cool modules they are using.</p><p>The second video goes a step further. I leverage the little talked about create-new-tool.sh script to automate the bulk of creating a new place holder for a tool in elmsln. It&#39;s the script that we&#39;ve run to generate the stub code for all the systems currently in the network.</p><p>From that stub code I walk through the process of pulling the modules into scope of elmsln from their original site and then tricking the site into looking and acting like it&#39;s part of elmsln. I finish by bundling up their configuration via features and convert the site into a full on install profile. By the end, the LOR thinks that it was actually produced using the initial install script of elmsln which would have put it at a lor.elmsln.local style address; going so far as to show that the assets created and modified in LOR now are registered in our compliance system automatically. The most important part of this entire process in my mind is that I write very little code and actually modify very few files beyond what the automation provides.</p><p>From here, we could easily commit it to the ELMSLN repo to be part of new networks that would be setup. Discussions revolving around doing this and the additional functionality to do to it (as well as how to refactor it further) will play out in this issue in the queue.</p>",
    "image":"/data/images/blog/birdfood.jpg",
    "largeImage":"/data/images/blog/birdfood.jpg"
  },
  {
    "name":"First+Look+at+Compliance+Auditing",
    "title":"First Look at Compliance Auditing",
    "subtitle": "you can comply",
    "authors": ["Bryan Ollendyke"],
    "date": "April 12, 2016",
    "category":"blog",
    "tags":["comply", "accessibility", "copyright", "quality", "ECD"],
    "videos": ["https://youtu.be/WtjQA5Iq90k"],
    "description":"<p>I&#39;ve watched our unit, colleagues and friends at other universities struggle with a complex issue that we are LEGALLY required to deal with; and that&#39;s navigating the tricky issues of compliance associated with production of digital media. The legal system and auditing complexities are only complicated by our LMS silos, file systems, dropboxes, and other distributed solutions that have things being produced all over the place and then worked into course content. Once there, the process slogs on in perpetuity as you or the next person never know when you&#39;ll uncover an accessibility issue or copyright violation unknowingly placed there by someone else who came in and &quot;just tweaked&quot; things.</p><p>Introducing ELMS Compliance Distribution (ECD). ECD has been in the roadmap awhile and I&#39;ve expressed the idea but never had a working prototype, until now. With the comply.elmsln domain, you&#39;ll be able to have a central dashboard with dedicated process for the management of everything going on in your learning ecosystem. The biggest questions this allows you to answer are:</p><ul><li>How much of our portfolio has had accessibility verified?</li><li>How much media are we using TeachAct to justify its use?</li><li>When was the last time we auditing course XYZ?</li><li>What items in course XYZ need verifying in the first place?</li></ul><p>Comply is intended to help democratize&nbsp;the process of compliance management and auditing by leveraging the RESTful communications in ELMSLN to notify other systems when their material has changed. For example. You might have all the best excel sheets in the world indicating that you are in compliance, but they don&#39;t mean a thing if someone updates content after you&#39;ve been combing through. With Comply, assets call home to report on their compliance status at the time of creation / update. This means that If you have a course with 200 pages that you&#39;ve verified, a month from now you&#39;ll know exactly which 10 pages the faculty member updated and that you need to reverify since someone last went through.</p><p>This isn&#39;t finished, but it&#39;s working and should provide a great example of just some of the things you can do when you change implementation methodology of your projects.</p>",
    "image":"/data/images/blog/stamp.jpg",
    "largeImage":"/data/images/blog/stamp.jpg"
  },
  {
    "name":"Tool+Builder",
    "title":"Tool Builder",
    "subtitle": "issue26",
    "authors": ["Bryan Ollendyke"],
    "date": "April 7, 2016",
    "category":"blog",
    "tags":["automation", "2020"],
    "videos": ["https://youtu.be/ejkdorx_vyk"],
    "description":"<p>This is one of the more insane things I&#39;ve ever added to the project. It will, pave the way to fundamentally changing who can contribute &quot;code&quot; and ideas. Ideas shouldn&#39;t stem from one person, or one group of people simply because they know how to write code and understand version control. I&#39;ll let the video speak for itself but I&#39;m having trouble containing my excitement throughout said video. We are moving beyond simple remix culture with this and into the elimination for the need to have developers to make meaningful, code based, contributions. People can model their ideas and show us instead of just describing them in the queues.<br />This is what I mean when I say things like &quot;unleashing innovation&quot; or &quot;sustainable innovation&quot;.<br />We want to empower you to empower and education others through constructing technology and then be able to share those constructions with others.</p>",
    "image":"/data/images/blog/UFO.jpg",
    "largeImage":"/data/images/blog/UFO.jpg"
  },
  {
    "name":"Making+the+Case+for+ELMSLN",
    "title":"Making the Case for ELMSLN",
    "subtitle": "pitching ELMSLN",
    "authors": ["Rick Humpheries"],
    "date": "March 15, 2016",
    "category":"blog",
    "tags":["management", "future", "sell", "pedagogy first"],
    "videos": [],
    "description":"<p><strong>The case for ELMSLN</strong></p><p>The ELMSLN team recently had interest from a developer working for a vendor/digital agency who was excited on a personal level by its potential, but felt that it would have been difficult to convince his boss to use ELMSLN over other established LMSs.</p><p>I could relate to how he was feeling. Although not completely in the same position as him (I work for a training provider rather than an agency itself), it still took a lot of time and hard campaigning to convince my board to take a chance on ELMSLN. The key for me was to hammer home the point that we needed to take a long term approach. Did we want to spend &#39;X&#39; amount on a new system only for it seem irrelevant and out of date within a few years? Absolutely not. The distributed systems approach provides the flexibility to innovate, customise, and react quickly to emerging pedagogies. These qualities are much more pronounced if you&#39;re taking the longer term view and this made total sense to me.</p><p>The system being based on Drupal was a big draw for me too. I was specifically looking for something built on Drupal at the time. The only other FOSS (free open source system) option for us seemed to be Moodle. However, I feel Moodle makes too many assumptions on how an online course should be taught, it looks out of date (in my opinion) and if you pass a Moodle course to an author and say &quot;there you go, add content&quot; they are likely to upload all their existing PDFs to it and call it an online course. I wanted to lay a foundation for providing online courses that could really enhance learning rather than replicate old methods on a different platform. <a href=\"https://groups.drupal.org/node/473003\">This post by opgobee on Drupal.org</a> probably sums up how I was feeling at the time and what led me to ELMSLN.</p><p>Another important decision (which, to be honest, I only realise I made with hindsight!) was not to get so hung up on needing everything on my feature list. As <a href=\"http://chronicle.com/article/What-s-Really-to-Blame-for/235620/\">this recent blog post by Michael Feldstein</a> more eloquently argues, trying to accommodate every feature that you&#39;ve been told must be included, just so you can tick things off a list is likely to cloud your judgement and lead you towards a less sustainable option. Believe me, there were quite a few requirements that ELMSLN didn&#39;t have at the time I was reviewing it! But it was a case of challenging and questioning some requirements (which can often lead to improved ways of doing things), jumping into the community and making a case for others, or building them ourselves (&lsquo;cause Drupal is great like that).</p><p>I was lucky that I was given the freedom to take the longer term view. But I suspect that many others who want to use ELMSLN for a commercial project with a client don&#39;t have that luxury when deadlines and launch dates come into play. One potential way is to sell the idea that you can be part of developing a system that will distinguish you from all the other vendors out there offering &#39;Moodle&#39; or &#39;Totara&#39; (tomayto, tomahto) services...you&#39;ll have a genuine alternative to pitch to other education providers. Another is to use ELMSLN&#39;s networked approach to your advantage, and pitch a gradual integration of services into a client&#39;s current learning system. This can help you to convince them that they can take advantage of some of the great features of ELMSLN, whilst still being able to retain specific features they may find difficult to move away from. For example, our setup included retaining our e-portfolio and assessment systems which we can link students through to via single-sign-on when necessary.</p><p>So be bold, don&#39;t be afraid to challenge convention, and make a case for ELMSLN.</p>",
    "image":"/data/images/blog/underground.jpg",
    "largeImage":"/data/images/blog/underground.jpg"
  },
  {
    "name":"Tipping+Point+Released",
    "title":"Tipping Point Released",
    "subtitle": "0.2.0",
    "authors": ["Bryan Ollendyke"],
    "date": "March 10, 2016",
    "category":"blog",
    "tags":["release", "tipping point", "0.2.0", "screencast"],
    "videos": ["https://youtu.be/ZSJmGBomnkM"],
    "description":"<p>I&#39;m pleased to announce the latest release of ELMSLN - Tipping point (0.2.0). Tipping point brings about massive improvements in usability, design, performance, bug fixes, documentation, and expanded capabilities. There were 118 issues resolved on the way to this release. To cap it off, I shot multiple videos showing the system running and explaining how to do different things in it as well as why certain design and architectural decisions have been made.</p><p>This is the first end-to-end style video that dives deep into the whole platform I&#39;ve done in several years. I&#39;m very proud of where our team is taking the network. Our development, student and&nbsp;pedagogical communities is growing. We&#39;re having more active contributions and feedback from a growing choir of voices who are tired of business as usual.</p><p>We want our education, our making, our creativity, and our pedagogy&nbsp;back;&nbsp;damnit! We&#39;re growing in number and&nbsp;Tipping point is aptly named for this fact, because we&#39;re reaching a tipping point. It&#39;s becoming increasingly easy to get new things in, easy to find, easy to do insane tasks with the push of a button. We&#39;re pushing forward on the crazy stuff like <a href=\"https://github.com/elmsln/elmsln/issues/567\">Voice based dictation,</a> <a href=\"https://github.com/elmsln/elmsln/issues/202\">Self organizing fractal networks</a>&nbsp;and less crazy but needs to have existed already stuff like&nbsp;<a href=\"https://github.com/elmsln/elmsln/issues/640\">Non linear&nbsp;adaptive and self-selecting course structures</a>.</p><p>The future we are creating is so bright, let&#39;s continue to make each other shine.&nbsp;<span style=\"font-size: 13px;\">Ex Uno Plures.</span></p>",
    "image":"/data/images/blog/waterfall.jpg",
    "largeImage":"/data/images/blog/waterfall.jpg"
  },
  {
    "name":"Significant+Events",
    "title":"Significant Events",
    "subtitle": "0.1.0!",
    "authors": ["Bryan Ollendyke"],
    "date": "February 18, 2016",
    "category":"blog",
    "tags":["0.1.0","students", "community"],
    "videos": [],
    "description":"<p>A significant event happened today, well, a few significant events:</p><ol><li><span style=\"font-size: 13px;\">One of our student developers fixed his course by authoring the code and saw the change reflected in his course while taking it</span></li><li><span style=\"font-size: 13px;\">We have 0 issues that the team&nbsp;marked as blocking issues for us to bump up a minor version to 0.1.0 which will push at 12:00am 2/18/16</span></li><li><span style=\"font-size: 13px;\">I upgraded 8 live deployments of ELMSLN while having meetings; I queued them up and Jenkins did all the work</span></li><li><span style=\"font-size: 13px;\">We now have a live demo, something that (oddly) we&#39;ve never had before. So why?</span></li><li><span style=\"font-size: 13px;\">We have a lot more people contributing issues, ideas, and code then we did even 2 months ago</span></li></ol><p><strong>Let&#39;s stop and take that in for a minute, one at a time.</strong></p><p>One.</p><p>Our student developer @mmilutinovic13 <a href=\"https://github.com/elmsln/elmsln/issues/467\">fixed this issue that he reported</a> while taking a science course powered by ELMS Learning Network. So he noticed an issue with his learning management system, reported the issue, we talked through what the best way to resolve it is, he tested the change, submitted a pull request (to have his code merged into the system) and then a few days later his LMS is enhanced. Now yes, Mark works for Arts &amp; Architecture and I dedicate his time towards fixing issues in ELMSLN but still, it&#39;s awesome what is possible when we empower all users to enact change.</p><p>Now, on to the 0 issue blocks on 0.1.0. What does that mean for the project. Well, it means that we&#39;ve been able to make a reasonable amount of progress against the goals outlined as 0.1.0 to say that it&#39;s something more stable then it was previously. We started into numbered versions right at the end of 2015. We&#39;ve gone through 10 point releases in the 0.0.x release cycle mostly to test out our infrastructures ability to upgrade itself. Well, it&#39;s getting very stable and able to upgrade successfully with little to no issues. The other major issue knocked out was a secure, self organizing single-sign on system. This is not to suggest there isn&#39;t more work to be done (there&#39;s tons) but we&#39;re reaching a level of stability that people can play with things and start to build against the world that the 4 colleges at Penn State and Buttercups training are actively using and growing up with.</p><p><span style=\"font-size: 13px;\">In the 8 deployments upgraded today there were 2 issues. 1 was a link that the deployment specifically deletes (and I know to do this) which is what powers the ELMSLN instance at </span><a href=\"http://stem-researchethics.org\" style=\"font-size: 13px;\">http://stem-researchethics.org/</a><span style=\"font-size: 13px;\">&nbsp;and the other had to do with VERY old courses that were the first 5 made in the infrastructure on my own setup (now going on 1.5 years ago) which again was effectively a handful of links. In each case it took about 5 minutes to fix all issues, combined and they are outliers.</span></p><p>Because of these things, we now have a <a href=\"http://online.do1.demos.elmsln.org\">demo</a>&nbsp;(staff / staff). It may seem odd to not have a demo previously but I refuse to do something unless it can be self sustaining. For example, this is the first time I&#39;ve written that we have a copy of ELMSLN that upgrades itself based on feedback from Travis CI, our automation testing robot. <a href=\"https://drupal.psu.edu/library/\">You can see this here</a> (though you&#39;d never know it&#39;s happening), and that&#39;s the point. If <a href=\"http://information.altruism.network/blog/post/organic-deployment-architecture\">we are seeking to build system that mirror life</a>, they must have methods in place to be self-sustaining. Automatic upgrading, refined &quot;one line&quot; installers (we have 4 now)&nbsp;and other infrastructure improvements are a MUST. Walk before you can crawl and you&#39;ll fail quickly.</p><p>Lastly, and I can&#39;t thank people enough for believing in this idea, our community is growing. We now have 2 core developers, access to a UX designer who informs the pedagogy of the project, 3 student developers, and now multiple learning designers, faculty members, &nbsp;and graphic designers across multiple disciplines that have contributed to our issue queues. We&#39;ve got training, K-12, Business, Arts, and Sciences contexts all represented across multiple issues and we&#39;ll only have more people in the queues soon as we are making it policy to have IDs associated with ELMSLN to communicate needs in this open format.</p><p>Thank you all so much for what we&#39;ve done to get here and what we are about to do. Never, stop, innovating. <a href=\"https://github.com/elmsln/elmsln/tree/0.1.0\">Happy birthday to me</a>.</p>",
    "image":"/data/images/blog/candle.jpg",
    "largeImage":"/data/images/blog/candle.jpg"
  },
  {
    "name":"2015",
    "title":"2015",
    "subtitle": "happy new year",
    "authors": ["Bryan Ollendyke"],
    "date": "January 4, 2016",
    "category":"blog",
    "tags":["past","retrospective", "new year"],
    "videos": [],
    "description":"<p>As the ELMS project (or some form of it) moves into its 8th year, we&#39;d like to take a moment and look back on all the great things from 2015.</p><ul><li>Our community presented&nbsp;ELMSLN at <strong>ten</strong>&nbsp;different events this year including one in the UK</li><li>ButterCups Training offcially joined our community</li><li>ButterCups lead Instructional Technologist Rick Humphries shot <a href=\"https://www.youtube.com/watch?v=_r1gJb6K9A0\">this video showing ELMSLN working with Learning Locker</a></li><li>We spread to PSU&nbsp;colleges&nbsp;of Agriculture, Business, Liberal Arts, and Sciences, bringing the active number of deployments at PSU to 5 with more colleges exploring</li><li>We added a full time&nbsp;core contributor from Eberly College of Science&nbsp;(Michael Potter)</li><li>We saw a former core contributor transition to a faculty leadership role as our UX lead (Michael Collins)</li><li>Countless accessibility improvements, the neatest of which was Speedreader</li><li>We got a killer new User Experience thanks to both Mikes</li><li>Remixables / Shareables / Shortcodes / <a href=\"https://www.youtube.com/watch?v=XB50GH8itgY&amp;index=11&amp;list=PLJQupiji7J5fdTItbAp-op9Gfiwx1LvEE\">Embed Anything, Anywhere</a> support including the ability to <a href=\"https://www.youtube.com/watch?v=2Uf52ncgCfs\">embed a complex submission widget</a> with a copy and paste</li><li>We added countless enhancements in usability while improving under the hood enhancements to give us a strong foundation to deploy from</li><li>We added &quot;<a href=\"https://www.youtube.com/watch?v=liTDeOev8pw&amp;index=2&amp;list=PLJQupiji7J5fdTItbAp-op9Gfiwx1LvEE\">one-line installers</a>&quot;, including support for Amazon EC2, CentOS 6.x/7.x, Debian and Ubuntu 14.x</li><li><a href=\"https://drupal.psu.edu/blog/post/pulling-git-repo-content-drupal\">Git based content management support</a> and importing to distribute ownership and liberate workflows</li><li>Leafy, a commandline helper for elmsln that can perform advanced server and elms related tasks automatically (like upgrading the codebase itself)</li><li>We got onto point releases (just before year&#39;s end)!</li><li>This updated community site you see currently</li><li>Official <a href=\"http://docs.elmsln.org\">documentation</a> and <a href=\"http://api.elmsln.org\">API</a> sites</li><li>We saw commits from multiple Drupal @ PSU community members bringing our totals roles with influence on the project to students, faculty, instructional designers, programmers, front end experts, devops experts and system admins</li><li>We started to see <a href=\"https://github.com/elmsln/elmsln/issues?utf8=%E2%9C%93&amp;q=is%3Aissue+label%3APedagogy+\">engaging pedagogical discussions</a> across institutions, job roles, sectors and continents</li><li>We showed production ready integrations with Learning Locker and Piwik for the two sides to analytics (pedagogical and support)</li><li>We were mentioned in the <a href=\"https://youtu.be/Pyn5RiW75pg?t=41m55s\">closing keynote of Sakai</a> as a piece of&nbsp;the Post-LMS Revolution</li><li style=\"font-size: 13px;\">We now have 13 tools under the hood with the majority of them being used in production</li></ul><p style=\"font-size: 13px;\">&nbsp;</p><p style=\"font-size: 13px;\">Tools currently seeing production usage at different institutions:</p><ul><li style=\"font-size: 13px;\"><strong>Online</strong> - Course Information Science&nbsp;- powering logistics and requesting new tools to be built</li><li style=\"font-size: 13px;\"><strong>Courses</strong>&nbsp;- Course content outline / instructional flow</li><li style=\"font-size: 13px;\"><strong>Studio</strong> - online media submission and critique</li><li style=\"font-size: 13px;\"><strong>Blogs</strong> - private (or public if configured) student journaling system</li><li style=\"font-size: 13px;\"><strong>Discuss</strong> - A simple discussion board engine</li><li style=\"font-size: 13px;\"><strong>Interact</strong> - Interactive course object repository, providing smartbuilder, interactive timelines, 3D in browser molecules (JMOL) and other crazy things</li><li style=\"font-size: 13px;\"><strong>Media</strong> - Asset management system for files, images, video, H5P interactive media and audio files</li><li style=\"font-size: 13px;\"><strong>Comply</strong> - Compliance management system for helping manage&nbsp;the legal issues involved with&nbsp;delivering <span style=\"font-size: 13px; line-height: 20px;\">education</span></li></ul><p style=\"font-size: 13px;\">&nbsp;</p><p style=\"font-size: 13px;\"><span style=\"font-size: 13px; line-height: 20px;\">Systems and enhancements&nbsp;that will see additional experimentation to seek graduation in 2016:</span></p><ul><li style=\"font-size: 13px;\"><span style=\"font-size: 13px; line-height: 20px;\"><strong>Assessment</strong> - A distributed gradebook that can grade anything whether it happens in elms or not as well as rolling in a robust rubric system&nbsp;</span></li><li style=\"font-size: 13px;\"><strong>Live Questions</strong> - a live question tool for synchronous classroom experiences to ask questions and socially up vote them with support for annonymous and public questioning</li><li style=\"font-size: 13px;\"><strong>Inbox</strong> - A heads up display for all users about whats going on in their network, what they should care about and what they should be working on next. This marries Learning Locker data with ELMSLN distributed dashboard data to give the student a richer experience with the system</li><li style=\"font-size: 13px;\"><span style=\"font-size: 13px; line-height: 20px;\"><strong>Learning Locker</strong> - More automated support for Learning Locker</span></li><li style=\"font-size: 13px;\"><strong>Chat engine</strong> - A nodejs based chat system for technical support as well as students chatting with others currently engaged in the same course network as them</li><li style=\"font-size: 13px;\"><span style=\"font-size: 13px; line-height: 20px;\"><strong>HAX</strong> - We will <a href=\"https://www.youtube.com/watch?v=1L7Nb3iw90w\">continue our work to kill WYSIWYG</a>&nbsp;(while still supporting it)</span></li><li style=\"font-size: 13px;\"><span style\"font-size: 13px; line-height: 20px;\"><a href=\"https://github.com/elmsln/elmsln/issues/new\">Your next big idea!</a></span></li></ul><p style=\"font-size: 13px;\">&nbsp;</p><p>We hope you had a great 2015 and that you&#39;ll join us for the ride. <a href=\"http://information.altruism.network/blog/post/organic-deployment-architecture\">It&#39;s going to be an amazing 2016</a>.</p>",
    "image":"/data/images/blog/fireworks.jpg",
    "largeImage":"/data/images/blog/fireworks.jpg"
  },
  {
    "name":"Where+We're+Going",
    "title":"Where We're Going",
    "subtitle": "know where you've been",
    "authors": ["Bryan Ollendyke", "Rick Humpheries"],
    "date": "November 6, 2015",
    "category":"blog",
    "tags":["XAPI", "competencies","history"],
    "videos": ["https://player.vimeo.com/video/144218562","https://youtu.be/q224P-PPhD0"],
    "description":"<p>I was presented with two videos today that show the contrast of where we&#39;ve been and where we&#39;re going rather nicely. &nbsp;The first is from 2013 in which I gave a talk at Drupal Camp Ohio about ELMSLN as an idea. It was just barely working, the UX was terrible and I talked way too much. But you can see the early signs of the concept, the organic nature and the system that sets itself up.</p><p>&nbsp;</p><p>It&#39;s also the first time that Michael Collins (UX lead / Arts &amp; Archicture&nbsp;Faculty, Program head) and Michael Potter (Core developer / Eberly College of Science) had seen me present on the idea. They had heard me around campus talk about this idea I had and how we could use Drupal to achieve it, but they never saw the big picture till after this talk. Neither one had any involvement with the platform aside from interest.</p><p>&nbsp;</p><p>Fast forward to today, both have found work that has allowed them to directly contribute to the platform and help others build education experiences using the technology. Both have made it more flexible and visually appealing then I ever could. We&#39;ve also got Rick Humphries influencing and expanding our original ideas abroad.</p><p>&nbsp;</p><p>In the second video, Rick showcases how he&#39;s starting to work competency based and Experience API (xAPI) statements into ELMSLN. This is still early both in usability and implementation, but has inspired the core development team to start pursuing Learning Locker / xAPI integration to see where we can take it.</p>",
    "image":"/data/images/blog/road.jpg",
    "largeImage":"/data/images/blog/road.jpg"
  },
  {
    "name":"State+of+UX+and+Community+Updates",
    "title":"State of UX and Community Updates",
    "subtitle": "graphic novels",
    "authors": ["Bryan Ollendyke"],
    "date": "August 31, 2015",
    "category":"blog",
    "tags":["state of the ELMS:LN", "MOOC","CLE", "discuss", "editorial", "course tour"],
    "videos": ["https://youtu.be/Xf8q3vq6rgE"],
    "description":"<p>This walkthrough shows a graphic novel course that we&#39;re really excited to be delivering this Fall (now). It showcases the current state of development of ELMSLN in the context of our Graphic Novel course. This is a unique oppurtunity for us as a learning design unit because we are embedded with the faculty in the physical classroom with their students. We&#39;ve had a lot of hands on time with the faculty and will be debriefing with the students throughout the semester and improving the user experience based on their feedback as we go.</p><p>&nbsp;</p><p>This shows not just the state of some of the system as I usually give a tour of, but a working course that&#39;s utilizing multiple, customized tools. This is the point of ELMS Learning Network in my mind, flexibility within a series of constraints (like hey, we want a space for students to visually submit and critique work), and then layering in customization to have the faculty own the experience.</p><p>&nbsp;</p><p>This also digs into some of the more advanced aspects of the &quot;embed anything, anywhere&quot; initative, the short-code tokens and what we now call &quot;Remixables&quot;; Tokens that make webservice queries and contextually rewrite themselves. In plain English, a shortcode that will ask the Studio (or whatever) if the current user has submitted an assignment, if they have, it displays a link to it, if not, it populates a link for them to complete the assignment in the flow of instruction. This allows them to not have to break from the interaction flow, while still leveraging the advantages of a network based approach to the education experience.</p><p>&nbsp;</p><p>It ends with me hinting at how exciting things are getting, because they are. I&#39;m also excited to announce a bit of a team shake up that&#39;s led to expansion. Michael Collins (User Experience Lead / Front-end Dev), has taken a job in the College of Arts &amp; Architecture (where I work) as the Faculty lead for a new, web based program. He will still be involved with ELMSLN but more in a pedagogical, faculty, and interface mock up role (when needed). He still remains a huge influence (visually, and direction) on the project.</p><p>&nbsp;</p><p>Eberly College of Science has hired a Drupal developer to replace him in Michael Potter. Michael&#39;s write up is now in the team section of this site, but we&#39;ve already seen rapid progress in the areas of accessibility and design consistency since he started just a few short weeks ago. Michael&#39;s expertise include front-end development, drupal site building, drupal development, drupal theming, git workflows, project management, and being passionate about his work and building cool things. We are excited to have him contributing as an ELMSLN core developer!</p><p>&nbsp;</p><p>In other community news, adopter Rick Humphries has a presentation accepted to A.L.T. to talk about ELMSLN&#39;s philosophy of design and his experiences working with it. If you are attending ALT, be sure to check it out!</p>",
    "image":"/data/images/blog/graphic_novels.jpg",
    "largeImage":"/data/images/blog/graphic_novels.jpg"
  },
  {
    "name":"Insert+Tokens+for+Submission",
    "title":"Insert Tokens for Submission",
    "subtitle": "anything, anywhere",
    "authors": ["Bryan Ollendyke"],
    "date": "July 28, 2015",
    "category":"blog",
    "tags":["token", "editorial", "MOOC", "CLE", "workflow"],
    "videos": ["https://youtu.be/2Uf52ncgCfs"],
    "description":"<p>UPDATE: I added a <a href=\"https://www.youtube.com/watch?v=XB50GH8itgY\">video that shows Automatic Token generation to allow embedding anything, anywhere.</a></p><p>&nbsp;</p><p>This shows the current state of a special token insert mode that allows for dynamically creating bindings to other services in ELMSLN. This allows your course outline to ask another system if the user has submitted an assignment (for example). If they have submitted &quot;Assignment 3&quot; (or whatever tag it is), it will present a link to their assignment submission, otherwise it will present a link for them to complete the assignment.</p><p>&nbsp;</p><p>Further more, Systems can have multiple &quot;Assignment 3&quot;s. It&#39;s looking up against a tag field on the thing that can be remote embedded and looked up. It looks at the section of the currently logged in user, then looks up what assignments that section uses, then cross references the tag requested in the token with what assignments their section allows.</p><p>&nbsp;</p><p>An example scenario would be 2 sections. S113 has 5 assignments, S200 has 6 assignments. They share 4 assignments, but assignment 5 the instructors disagree on. Each section can have the same content presented, managed by the lead faculty for instances, but allow each instructor to utilize a different assignment 5.</p><p>Section S200 also has an additional assignment. In the event that the assignment look up does not return anything for that Tag, it will render nothing. This means that parts of the content will be contextually rewritten both for the section as well as the submissions required to complete the material.</p><p><br />Disclaimer: This is a prototype, ending usability may differ from what&#39;s in this video.</p>",
    "image":"/data/images/blog/coins.jpg",
    "largeImage":"/data/images/blog/coins.jpg"
  },
  {
    "name":"July+State+of+ELMSLN",
    "title":"July State of ELMS:LN",
    "subtitle": "kitchen sink",
    "authors": ["Bryan Ollendyke"],
    "date": "July 15, 2015",
    "category":"blog",
    "tags":["State of the ELMS:LN", "screencast","CLE", "discuss", "editorial", "blog", "journal", "CIS","elmsmedia", "comply"],
    "videos": ["https://youtu.be/4oZaA5BOjNI"],
    "description":"<p>This video shows&nbsp;the current state of ELMSLN developments using the Vagrant VM Image. The latest efforts have been in the areas of User experience and design.</p><p>&nbsp;</p><p>This tours the system as a whole with what you can get running today, focusing on the Course outline portion of the platform but touching on (deep breathe)...</p><ul><li>Course information system</li><li>Discussion tool</li><li>Open Studio environment</li><li>Journaling system</li><li>Asset Management system</li></ul><p>&nbsp;</p><p>I also cover:</p><ul><li>H5P</li><li>the fact that everything is a webservice</li><li>we can get data to and from anywhere</li><li>Leafy / commandline elmsln</li></ul><p>&nbsp;</p><p>The feature set that I laid out a vision of several years ago is starting to come togehter usability and experience wise in ways I would have never been able to go alone. Much of the credit there goes to UX lead Michael Collins who&#39;s done an incredible job. User testing with many, many Instructional designers both in person via sprints and virtually in the issue queues has been invaluable.</p><p>&nbsp;</p><p><span style=\"font-size: 13px;\">This is probably the most&nbsp;comprehensive ELMSLN video I&#39;ve ever put together though you might want to watch the OpenEd philosophy of design discussion if you have trouble following the architecture.&nbsp;</span><span style=\"font-size: 13px; line-height: 20px;\">There&#39;s still much work to do but it&#39;s getting pretty awesome to look at and work with.</span></p><p>&nbsp;</p><p><span style=\"font-size: 13px;\">We are building something awesome over here. Join us.sc</span></p>",
    "image":"/data/images/blog/logo.png",
    "largeImage":"/data/images/blog/logo.png"
  },
  {
    "name":"ELMSLN+Community+Development",
    "title":"ELMS:LN Community Development",
    "subtitle": "xapi",
    "authors": ["Rick Humphries"],
    "date": "June 30, 2015",
    "category":"blog",
    "tags":["community", "XAPI","H5P"],
    "videos": ["https://youtu.be/_r1gJb6K9A0"],
    "description":"<p>This was originally published on our issue queue by <a href=\"https://github.com/rickhumphries\">@rickhumphries</a></p><p>&nbsp;</p><p style=\"box-sizing: border-box; margin-bottom: 16px; color: rgb(51, 51, 51); font-family: 'Helvetica Neue', Helvetica, 'Segoe UI', Arial, freesans, sans-serif; font-size: 14px; line-height: 22.3999996185303px; background-color: rgb(255, 255, 255);\">I&#39;ve been asked by&nbsp;<a class=\"user-mention\" href=\"https://github.com/btopro\" style=\"box-sizing: border-box; color: rgb(51, 51, 51); font-weight: bold; white-space: nowrap;\">@btopro</a>&nbsp;to provide a brief run through of the things that we&#39;ve changed/added to the system and where they currently live - most are in the CIS though with only H5P being added to Media:</p><h2 style=\"box-sizing: border-box; margin-top: 1em; margin-bottom: 16px; line-height: 1.225; font-size: 1.75em; position: relative; padding-bottom: 0.3em; border-bottom-width: 1px; border-bottom-style: solid; border-bottom-color: rgb(238, 238, 238); color: rgb(51, 51, 51); font-family: 'Helvetica Neue', Helvetica, 'Segoe UI', Arial, freesans, sans-serif; background-color: rgb(255, 255, 255);\">CIS</h2><h3 style=\"box-sizing: border-box; margin-top: 1em; margin-bottom: 16px; line-height: 1.43; font-size: 1.5em; position: relative; color: rgb(51, 51, 51); font-family: 'Helvetica Neue', Helvetica, 'Segoe UI', Arial, freesans, sans-serif; background-color: rgb(255, 255, 255);\">Content Types</h3><ul style=\"box-sizing: border-box; padding-left: 2em; margin-bottom: 16px; color: rgb(51, 51, 51); font-family: 'Helvetica Neue', Helvetica, 'Segoe UI', Arial, freesans, sans-serif; font-size: 14px; line-height: 22.3999996185303px; background-color: rgb(255, 255, 255);\"><li style=\"box-sizing: border-box;\">Course Module - provides all the information required for how a student can view their progress on a course. So a course might be made up of 10 modules - this content holds data such as ID, it&#39;s weighting (i.e. learning hours to complete), whether it&#39;s a core/optional module.</li><li style=\"box-sizing: border-box;\">Course Competency - course modules can be achieved by completing all the competencies associated with it. A competency can be marked as complete either manually by the, or through the recording of xAPI statements. So this content type allows you to set the xAPI activity URLs and verbs that are associated with it.</li></ul><h3 style=\"box-sizing: border-box; margin-top: 1em; margin-bottom: 16px; line-height: 1.43; font-size: 1.5em; position: relative; color: rgb(51, 51, 51); font-family: 'Helvetica Neue', Helvetica, 'Segoe UI', Arial, freesans, sans-serif; background-color: rgb(255, 255, 255);\">People</h3><ul style=\"box-sizing: border-box; padding-left: 2em; margin-bottom: 16px; color: rgb(51, 51, 51); font-family: 'Helvetica Neue', Helvetica, 'Segoe UI', Arial, freesans, sans-serif; font-size: 14px; line-height: 22.3999996185303px; background-color: rgb(255, 255, 255);\"><li style=\"box-sizing: border-box;\">Account data - we&#39;ve added fields to handle the import of student personal data from external database here</li><li style=\"box-sizing: border-box;\">Course progress - admin view which handles import of student course data from external database. Essentially a set of tables showing all course/module/competency data. This is used to inform a &#39;view progress&#39; area that a student can access from the dashboard</li></ul><h3 style=\"box-sizing: border-box; margin-top: 1em; margin-bottom: 16px; line-height: 1.43; font-size: 1.5em; position: relative; color: rgb(51, 51, 51); font-family: 'Helvetica Neue', Helvetica, 'Segoe UI', Arial, freesans, sans-serif; background-color: rgb(255, 255, 255);\">Open Badges</h3><p style=\"box-sizing: border-box; margin-bottom: 16px; color: rgb(51, 51, 51); font-family: 'Helvetica Neue', Helvetica, 'Segoe UI', Arial, freesans, sans-serif; font-size: 14px; line-height: 22.3999996185303px; background-color: rgb(255, 255, 255);\">This is a space for admin to create a badge that will be awarded based on the recording of xAPI statements - and fill in all the other meta data for it, including associating it with a course and section. All badges that a user can achieve based on the course/section they&#39;re enrolled on will display in the &#39;achievements&#39; area of the dashboard.</p><h3 style=\"box-sizing: border-box; margin-top: 1em; margin-bottom: 16px; line-height: 1.43; font-size: 1.5em; position: relative; color: rgb(51, 51, 51); font-family: 'Helvetica Neue', Helvetica, 'Segoe UI', Arial, freesans, sans-serif; background-color: rgb(255, 255, 255);\">Dashboard</h3><p style=\"box-sizing: border-box; margin-bottom: 16px; color: rgb(51, 51, 51); font-family: 'Helvetica Neue', Helvetica, 'Segoe UI', Arial, freesans, sans-serif; font-size: 14px; line-height: 22.3999996185303px; background-color: rgb(255, 255, 255);\">This is the page that users go to when they log in. From here they can see the courses they&#39;re enrolled on, access these course spaces, view their progress so far on that course, view achievements, edit contact details, access their messages inbox.</p><ul style=\"box-sizing: border-box; padding-left: 2em; margin-bottom: 16px; color: rgb(51, 51, 51); font-family: 'Helvetica Neue', Helvetica, 'Segoe UI', Arial, freesans, sans-serif; font-size: 14px; line-height: 22.3999996185303px; background-color: rgb(255, 255, 255);\"><li style=\"box-sizing: border-box;\">View progress - shows which modules have been achieved etc. along with some custom % calculations for progress and expected progress). Data mainly taken from People-&gt;Course Progress</li><li style=\"box-sizing: border-box;\">Edit contact details - allows the student to manually alter some of their account data, including password</li><li style=\"box-sizing: border-box;\">Achievements - shows the badges that a student has either earned or is able to earn. Badges that have not yet been earned are shown with a locked icon.</li><li style=\"box-sizing: border-box;\">Messaging - staff can send messages to students and tag the messages with the course it relates to. Students can currently only view messages, not send any.</li></ul><h3 style=\"box-sizing: border-box; margin-top: 1em; margin-bottom: 16px; line-height: 1.43; font-size: 1.5em; position: relative; color: rgb(51, 51, 51); font-family: 'Helvetica Neue', Helvetica, 'Segoe UI', Arial, freesans, sans-serif; background-color: rgb(255, 255, 255);\">Search Students</h3><p style=\"box-sizing: border-box; margin-bottom: 16px; color: rgb(51, 51, 51); font-family: 'Helvetica Neue', Helvetica, 'Segoe UI', Arial, freesans, sans-serif; font-size: 14px; line-height: 22.3999996185303px; background-color: rgb(255, 255, 255);\">This is mainly a tool to be used by admin and other staff members who want to quickly get at data associated with groups of students and perform some bulk operations.<br style=\"box-sizing: border-box;\" />I&#39;m not sure whether this currently pulls in students from our external database or from &#39;People&#39;, but it allows you to build a table (hide/remove columns), filter students based on a number of parameters, and then either export this view as a CSV file, or select these students and send all of them a message, issue all of them a badge, or send an xAPI statement for each.</p><p style=\"box-sizing: border-box; margin-bottom: 16px; color: rgb(51, 51, 51); font-family: 'Helvetica Neue', Helvetica, 'Segoe UI', Arial, freesans, sans-serif; font-size: 14px; line-height: 22.3999996185303px; background-color: rgb(255, 255, 255);\">This is an admin tool for now, but once the system has developed a bit further and the bits regarding course roles and groups has been sorted it will be the area that external managers/mentors will use to quickly view student progress, see who is falling behind etc.</p><h2 style=\"box-sizing: border-box; margin-top: 1em; margin-bottom: 16px; line-height: 1.225; font-size: 1.75em; position: relative; padding-bottom: 0.3em; border-bottom-width: 1px; border-bottom-style: solid; border-bottom-color: rgb(238, 238, 238); color: rgb(51, 51, 51); font-family: 'Helvetica Neue', Helvetica, 'Segoe UI', Arial, freesans, sans-serif; background-color: rgb(255, 255, 255);\">Media</h2><h3 style=\"box-sizing: border-box; margin-top: 1em; margin-bottom: 16px; line-height: 1.43; font-size: 1.5em; position: relative; color: rgb(51, 51, 51); font-family: 'Helvetica Neue', Helvetica, 'Segoe UI', Arial, freesans, sans-serif; background-color: rgb(255, 255, 255);\">H5P</h3><p style=\"box-sizing: border-box; margin-bottom: 16px; color: rgb(51, 51, 51); font-family: 'Helvetica Neue', Helvetica, 'Segoe UI', Arial, freesans, sans-serif; font-size: 14px; line-height: 22.3999996185303px; background-color: rgb(255, 255, 255);\">Short one this! All we&#39;ve done here is add the H5P module to Media. We set up interactive H5Ps here, then use the embed code to embed the activity in a course outline. We have code which listens for the xAPI statements generated from the activity, and turns this into a JSON format that can be accepted by our Learning Locker Learning Record Store.</p><h2 style=\"box-sizing: border-box; margin-top: 1em; margin-bottom: 16px; line-height: 1.225; font-size: 1.75em; position: relative; padding-bottom: 0.3em; border-bottom-width: 1px; border-bottom-style: solid; border-bottom-color: rgb(238, 238, 238); color: rgb(51, 51, 51); font-family: 'Helvetica Neue', Helvetica, 'Segoe UI', Arial, freesans, sans-serif; background-color: rgb(255, 255, 255);\">Learning Locker</h2><p style=\"box-sizing: border-box; margin-bottom: 16px; color: rgb(51, 51, 51); font-family: 'Helvetica Neue', Helvetica, 'Segoe UI', Arial, freesans, sans-serif; font-size: 14px; line-height: 22.3999996185303px; background-color: rgb(255, 255, 255);\">Acts as an authority which records all xAPI statements.</p><p style=\"box-sizing: border-box; color: rgb(51, 51, 51); font-family: 'Helvetica Neue', Helvetica, 'Segoe UI', Arial, freesans, sans-serif; font-size: 14px; line-height: 22.3999996185303px; background-color: rgb(255, 255, 255);\">Think that&#39;s about it!</p>",
    "image":"/data/images/blog/microphone.jpg",
    "largeImage":"/data/images/blog/microphone.jpg"
  },
  {
    "name":"Meet+Leafy+ELMSLNs+Interactive+Command+Prompt",
    "title":"Meet Leafy, ELMS:LN's Interactive Command Prompt",
    "subtitle": "leafy green",
    "authors": ["Bryan Ollendyke"],
    "date": "June 6, 2015",
    "category":"blog",
    "tags":["sysadmin", "devops","leafy"],
    "videos": ["https://youtu.be/II_1iaw8UPk"],
    "description":"<p>Leafy is an interactive command prompt for ELMS Learning Network that can help you perform all kinds of different sys admin tasks in elmsln with relative ease. In this video we show how leafy can be used to quickly get feedback about all the sites in your elmsln instance, fix permissions issues, refresh your drush / user config, and remove unwanted sites from your network. This is just the beginning for leafy which is named for our old project branding of the black drupal leaf.</p>",
    "image":"/data/images/blog/salad.jpg",
    "largeImage":"/data/images/blog/salad.jpg"
  },
  {
    "name":"Building+a+Drupal+Based+LMS+for+Educational+Institutions",
    "title":"Building a Drupal Based LMS for Educational Institutions",
    "subtitle": "leafy green",
    "authors": ["Nash Ogden", "Sathish Kumar Mariappan"],
    "date": "March 3, 2015",
    "category":"blog",
    "tags":["community", "presentation"],
    "videos": ["https://player.vimeo.com/video/111237065"],
    "description":"<p>We were made aware recently that a vendor in the Atlanta area gave a talk on Drupal LMS and LCMS technologies in which ELMS Learning Network was discussed. This presentation is not given by active members of the ELMSLN community but its always promising to hear others express the concepts of ELMS after exploring them for themself. It also provides context that this is not the only group pursuing a Drupal based, open community ed tech solution as&nbsp;<a href=\"https://www.opigno.org\">Opigno LMS</a>&nbsp;is also discussed at length.</p>",
    "image":"/data/images/blog/pattern.png",
    "largeImage":"/data/images/blog/pattern.png"
  },
  {
    "name":"ELMS+Media+Custom+Transcription+Workflow",
    "title":"ELMS Media Custom Transcription Workflow",
    "subtitle": "a11y",
    "authors": ["Bryan Ollendyke"],
    "date": "December 9, 2014",
    "category":"blog",
    "tags":["accessibility", "presentation"],
    "videos": ["https://youtu.be/AhtF6NWuVXs"],
    "description":"<p><span style=\"font-size: 13px;\">@btopro was recently asked to do a webinar with automated transcription vendor&nbsp;</span><a href=\"http://3playmedia.com\" style=\"font-size: 13px;\">3playmedia</a><span style=\"font-size: 13px;\">. In the webinar, @btopro shows how PSU Arts &amp; Architecture uses&nbsp;ELMS Media (Drupal 6.x) to automate the embedding of media. It also digs into some of the magic of the system&#39;s 3playmedia integration to allow for an automated transcription workflow, ultimately making media more accessible with less overhead.</span></p><p>While not currently in the Drupal 7 version of ELMS Media, this is a clear indication of the direction that <a href=\"http://drupal.org/project/elmsmedia\">ELMS Media</a> is heading as part of ELMSLN.</p>",
    "image":"/data/images/blog/blank.jpg",
    "largeImage":"/data/images/blog/blank.jpg"
  },
  {
    "name":"OpenEd+2014",
    "title":"OpenEd 2014",
    "subtitle": "opened 2014",
    "authors": ["Bryan Ollendyke"],
    "date": "November 24, 2014",
    "category":"blog",
    "tags":["presentation"],
    "videos": ["https://youtu.be/CKZLuYOnPCk"],
    "description":"<p>This is a presentation by Bryan Ollendyke given at Open Ed 2014 on how ELMS Learning Network's design can lead to the opening of more content in more places. It talks through the current state of the project, who's involved, and explains the concept of the design of the system structure in a completely non-technical way.  While this was originally given in November 2014 in DC, it has been recorded based on the state of the project Feb 2015.</p>",
    "image":"/data/images/blog/morespirals.jpg",
    "largeImage":"/data/images/blog/morespirals.jpg"
  },
  {
    "name":"ELMSLN+DrupalCon+Austin+Presentation",
    "title":"ELMS:LN DrupalCon Austin Presentation",
    "subtitle": "#dcaustin",
    "authors": ["Bryan Ollendyke"],
    "date": "June 9, 2014",
    "category":"blog",
    "tags":["drupal","presentation"],
    "videos": ["https://youtu.be/6kRau5-i4Fc"],
    "description":"<p>The&nbsp;<a href=\"https://austin2014.drupal.org/session/dear-edtech-elmsln-here-and-it-wants-replace-your-vendors\">ELMSLN Drupalcon Austin 2014</a> presentation&nbsp;is now online! We had a good crowd in attendance and were happy to talk to many individual educational institutions, vendors and impressed parties throughout all of Drupalcon. The talk is an hour long and is the most comprehensive discussion of philosophy of design ever done in one place about the network. It then flows from there into some ranting and finally into a current state of the network demonstration. &nbsp;The last 5 minutes or so are a total (intentional) blur of just how much is crammed into this system now that it&#39;s being built out as a system of systems.</p><p>Enjoy!</p>",
    "image":"/data/images/blog/drupalcom_austin.jpg",
    "largeImage":"/data/images/blog/drupalcom_austin.jpg"
  },
  {
    "name":"UW+Madison+Law+School+Awarded+Grant+to+Pilot+ELMSLN",
    "title":"UW-Maddison Law School Awarded Grant to Pilot",
    "subtitle": "uw law elmsln pilot",
    "authors": ["Bryan Ollendyke"],
    "date": "March 31, 2014",
    "category":"blog",
    "tags":["UW","grant"],
    "videos": [],
    "description":"<p>The University of Wisconsin Madison Law School has been awarded an internal innovation grant to pursue the course development. &nbsp;You can <a href=\"http://www.law.wisc.edu/newsletter/Articles/Law_School_programs_receive_fund_2014-03-04\">read their official release here</a>.</p><p>Their press release on the topic states that</p><blockquote>&quot;The new funds support the development of a pilot, Drupal-based course instruction system that will serve as a model for other Law School clinics.&quot;</blockquote><p>&nbsp;The reason that this is being posted here though is if you go through the winning proposal, it talks about that &quot;Drupal-based course instruction system&quot; as being ELMSLN! The Center for Patient partnerships, a group within the Law College, has been running the MOOC and ELMSMedia distributions to power several online courses the last few months. &nbsp;After two successful semesters, they are going to get the opportunity to roll out the full ELMSLN package at greater scale with a goal of serving as a platform for the college to use.</p><p>The College of Arts &amp; Architecture&#39;s e-Learning Institute will be having discussions with UW-Madison Law School in the coming weeks!</p>",
    "image":"/data/images/blog/blank.jpg",
    "largeImage":"/data/images/blog/blank.jpg"
  },
  {
    "name":"Talking+Drupal+ELMSLN+Interview",
    "title":"Talking Drupal ELMS:LN Interview",
    "subtitle": "talking drupal",
    "authors": ["Bryan Ollendyke"],
    "date": "March 14, 2014",
    "category":"blog",
    "tags":["interview","drupal"],
    "videos": ["https://youtu.be/fgygtVDsy5E"],
    "description":"<p>This is an Interview with Bryan Ollendyke by the crew from <a href=\"https://www.youtube.com/user/TalkingDrupal\">Talking Drupal</a>. &nbsp;The interview covers:</p><ul><li>elearning in general</li><li>elearning in Drupal</li><li>Understanding what ELMSLN is and how it operates</li><li>Technical discussion of distributed web services and module choices in Drupal</li><li>DSLM to bundle all of these things together cleanly</li><li>Profiler Builder module</li></ul><p>&nbsp;</p><p>This interview took place on March 12th, 2014</p>",
    "image":"/data/images/blog/talking_drupal.jpg",
    "largeImage":"/data/images/blog/talking_drupal.jpg"
  },
  {
    "name":"ELMSLN+Doodle",
    "title":"ELMS:LN Doodle",
    "subtitle": "#doodles",
    "authors": ["Bryan Ollendyke"],
    "date": "March 4, 2014",
    "category":"blog",
    "tags":["doodles","screencast"],
    "videos": ["https://youtu.be/-DUo4StA8tY"],
    "description":"<p>I&#39;m starting to do a series of doodles to explain different concepts about ELMSLN because of how complex a structure we&#39;re talking about. &nbsp;When saying &quot;it&#39;s a new structure for LMS design&quot; that has to come with visuals detailing the new structure instead of just flowery language to suggest its different.</p><p>The first three videos in this playlist cover different aspects of ELMSLN. &nbsp;The first video details what ELMSLN is trying to be and some examples of how courses live amongst the tools in the network as well as describing some use-cases. &nbsp;It also puts forth a defense for the need for a new structure and how this is not just a &quot;use Drupal&quot; thing and could easily be setup to utilize lots of other tools together (Drupal just being the one I push).</p><p>The other two videos talk about ways ELMSLN addresses security and developing for the system using Vagrant (as well as what Vagrant and Chef are). &nbsp;As always, if you have questions please ask across the various mediums and I&#39;ll be happy to do another doodle-cast to explain. &nbsp;My goofy humor is mixed throughout as there is no script for theses videos.</p>",
    "image":"/data/images/blog/elmslndoodle.jpg",
    "largeImage":"/data/images/blog/elmslndoodle.jpg"
  },
  {
    "name":"Modules+Unraveled+Interview",
    "title":"Modules Unraveled Interview",
    "subtitle": "elmsln unraveled",
    "authors": ["Bryan Ollendyke"],
    "date": "November 6, 2013",
    "category":"blog",
    "tags":["interview","drupal"],
    "videos": ["https://youtu.be/HQGYusmQFCQ"],
    "description":"<p>@btopro recently gave an interview for the Modules Unraveled Podcast about ELMS.  Check it out to hear all about the ELMS Learning Network, where it's been, where it's going and a bit about Drupal in Education in general.</p>",
    "image":"/data/images/blog/blank.jpg",
    "largeImage":"/data/images/blog/blank.jpg"
  },
  {
    "name":"ELMSLN+Style+Guide+Released",
    "title":"ELMS:LN Style Guide Released!",
    "subtitle": "style guide",
    "authors": ["Bryan Ollendyke"],
    "date": "October 16, 2013",
    "category":"blog",
    "tags":["styleguide","design"],
    "videos": [],
    "description":"<p>Download the &nbsp;<a href=\"http://elms-styles.jayperryworks.com/\">ELMS Style guide</a> from the microsite or <a href=\"http://github.com/elmsln/elms-styles/\">fork it on github</a>.</p><p>After months of hard work and abstraction from original deliverable, the ELMS Design and Style Guide has been released. &nbsp;This is a professionally produced, extremely high quality, responsive minded, and completely open style guide provided&nbsp;under Creative Commons Attribution-ShareAlike 3.0. &nbsp;<a href=\"http://jayperryworks.com\">Jay Perry Works</a> was originally contracted to produce a style guide for the e-Learning Institute (ELMS Initiative home) to help influence the design and rebranding of the Institute as a larger part of the College or Arts &amp; Architecture.&nbsp;This style guide was produced to help give consistency and design quality to the&nbsp;Course Information System distribution.</p><p>While the style guide is still being implemented in ELMS: CIS as part of the default theme the style guide driving the look and feel of that theme are dictated by Jay Perry Works incredible work. &nbsp;After final approval of the style guide for the e-Learning Institute, we asked&nbsp;Jay to reproduce an Open Source version of the design guide for public use. &nbsp;The theme for CIS would already be released under GPL 2.0 because of Drupal code licensing, so sourcing the style guide only made sense.</p><p>Jay produced the open version of the ELMS style guide on his own&nbsp;time&nbsp;because of his&nbsp;appreciation of open source&nbsp;and wanting to see&nbsp;ELMS more widely adopted. &nbsp;Thank you Jay for all your hard work on this, it will serve as a basis for design revisions of all systems, widgets, and themes produced as part of the ELMS Learning Network going forward.</p>",
    "image":"/data/images/blog/styleguide.png",
    "largeImage":"/data/images/blog/styleguide.png"
  },
  {
    "name":"2013+State+of+the+Screencast",
    "title":"2013: State of the Screencast",
    "subtitle": "a network is born",
    "authors": ["Bryan Ollendyke"],
    "date": "September 13, 2013",
    "category":"blog",
    "tags":["screencast"],
    "videos": ["https://youtu.be/Zi2UMF9Ky6Q"],
    "description":"<p>This is one of the first ramble-laden screencasts I&#39;ve done in awhile demonstrating the state of the ELMS Learning network. &nbsp;I talk and blog about ELMS Learning Network a lot, but I&#39;m often bogged down in supporting legacy architecture as well as ramping up for new functionality in ELMS LN to really stop and have a day of investment in communicating about the platform. &nbsp;Today&#39;s our lucky day!</p><p>This video shows the state of some of the following pieces in the network and how they all play together.</p><ul><li>LTI replication to spider the ELMS learning network based on a single call</li><li>How the CIS and MOOC distributions have a conversation based on needs</li><li>CIS as logistics engine for managing the setup and long term life of courses over time</li><li>How this is (so) different from ELMS in Drupal 6 and infinitely more powerful / flexible an approach</li><li>Talking a bit about the structure and plans for the network</li><li>Showing basic usability and experience design elements across the platform</li><li>The basic functionality of the MOOC distribution after it&#39;s been automatically setup via LTI launch</li><li>Some other stuff I probably forget now</li></ul><p>I apologize for now showing more, I had some technical difficulties with firewalls just before recording so once I get those resolved I&#39;ll be posting another video stepping through the launch, to the backend implications, to the site creation, which should have all come prior to this video. &nbsp;It takes me a long time to show and talk through how this all works; please realize it is years of work in the making and basically what I think about and do all the time. &nbsp;This has consumed much of my 20s and I&#39;m very happy with what my 20s are making possible.</p><p>&nbsp;</p><p>Enjoy.</p>",
    "image":"/data/images/blog/snowflake.png",
    "largeImage":"/data/images/blog/snowflake.png"
  },
  {
    "name":"Design+Philosophy+and+Theory",
    "title":"Design Philosophy & Theory",
    "subtitle": "design",
    "authors": ["Bryan Ollendyke"],
    "date": "September 13, 2013",
    "category":"blog",
    "tags":["design", "theory", "philosophy"],
    "videos": ["https://youtu.be/Zi2UMF9Ky6Q"],
    "description":"<p>*note: This is a repost originally from&nbsp;btopro.com&nbsp;</p><p>Far more important then the technology you select for anything is the design. &nbsp;Quality, well thought out and executed design is difficult to accomplish and requires many iterations over ideas. &nbsp;You need to allow certain concepts to fail and others to flourish and be willing to switch to better ways of thinking mid development at times (and refactor and refactor again..). &nbsp;This is true of any technology you select and as such, philosophy of design and theory are paramount in the development of the ELMS learning network.</p><h2>Design Philosophy</h2><p>In a world of constant chaos of technological design where any 12 year old prodigy can disrupt your entire business model, it&#39;s critical to stick to a method of tool development that can stand the constant winds of disruption. &nbsp;I won&#39;t go into great detail as to why I chose Drupal over an <em>actual</em>&nbsp;educational platform but the primary reason is flexibility. A community so vast will breed superior solutions to those found purely within edtech. Have you used or seen any of the&nbsp;<em>popular&nbsp;</em>MOOC authoring experiences? Drupal from 4 years ago slaughters it let alone today or tomorrow&#39;s Drupal! &nbsp;It is for this reason that the solutions to save edtech don&#39;t lie in the vendors traditionally pushing you edtech. It is with this philosophy that we&#39;ve won multiple awards for &quot;Innovation&quot; and plan to do so with a development team of 1. &nbsp;This is possible because the reuse of the work of others leads to a development team of thousands. &nbsp;While the implementation is only one; the available code-base is produced and refined by thousands upon thousands of developers&#39; eyes daily. In the Learning Network though there is one primary implementation philosophy that powers everything: <a href=\"http://en.wikipedia.org/wiki/Representational_state_transfer\" target=\"_blank\" title=\"REST\">RESTful APIs</a>&nbsp;which in the current Drupal 7 portion of the CIS is powered by the <a href=\"https://drupal.org/project/restws\" target=\"_blank\" title=\"RestWS\">RESTful Web Services Module</a>&nbsp;(restws).</p><h2>Network Topology</h2><p>Stepping back from Drupal to network implementations in general, we need to find a structure that best mirrors a need for structured yet loosely connected environments. &nbsp;For this reason, I&#39;ve decided to base the ELMS LN on a combination of <a href=\"http://en.wikipedia.org/wiki/Network_topology\" target=\"_blank\" title=\"Star and Fully Connected Topology\">Star and Fully Connected Topology</a>. &nbsp;The deployment methodology of the Course Information System being the center of the ELMS universe, drives the creation of course networks.</p><h3>Star Topology</h3><p><a href=\"http://btopro.files.wordpress.com/2013/08/cis-star.jpg?w=650\"><img alt=\"CIS Star Topology\" class=\"wp-image\" height=\"454\" id=\"i-320\" src=\"http://btopro.files.wordpress.com/2013/08/cis-star.jpg?w=650\" title=\"CIS Star Topology\" width=\"390\" /></a>&nbsp; This topology enables the CIS to have a say in coordinating the connections between all other systems in the network. &nbsp;While all of these services pictured&nbsp;<em>could&nbsp;</em>live on their own, it&#39;s obviously more helpful that they have a consistent connection back to the CIS when needed. This is just for the initial setup of the network. &nbsp;Data systems can then be wired into the CIS so that information is populated automatically and propagated back down to the rest of the services that it is aware of. &nbsp;This is critical towards making the learning network effectively self aware; this base architectural decision. &nbsp;Without understanding that this is the base layer, the rest will appear as chaos (and very quickly).</p><h3>Fully Connected (through the sub-net)</h3><p><a href=\"http://btopro.files.wordpress.com/2013/08/cis-connected.jpg?w=650]\"><img alt=\"Fully Connected\" class=\"wp-image\" height=\"377\" id=\"i-327\" src=\"http://btopro.files.wordpress.com/2013/08/cis-connected.jpg?w=650\" title=\"Fully Connected\" width=\"390\" /></a> Fully Connected,&nbsp;</p><address>This is what the CIS starts to allow to be generated: chaos downstream. &nbsp;The instances are formulated based on data thats shipped to the CIS / Middleware (other LMS APIs and what not). These instances could connect to all other instances but the only way this would make sense is when the instances are related.</address><address>For this, we use a consistent pattern match against the services used in a course network loop. &nbsp;This can be engineered in a consistent manner as follows: {service}.{college}/{course}. &nbsp;</address><address>Example course sub-net for Math 100:</address><ul><li>online.college.com/math100 -- markets the course and helps organize internal logic for staff roles and web service agent accounts</li><li>courses.college.com/math100 -- the primary outline of the course that helps form a logical instructional flow for students</li><li>studio.college.com/math100 -- the place assignments are submitted</li><li>analytics.college.com/math100 -- an invisible RESTful engine that aggregates data silently for instructors and staff to gain insight into the analytics of the course</li></ul><address>This allows all services in the network to easily sniff out other services in the network and broadcast RESTful API communications back and forth. &nbsp;The CIS can be utilized to understand the topology of a CIS Sub-net as some sub-nets may be made up of a different set of course tools then another. &nbsp;Maybe the only thing required for a course is the outline tool, why clog up the feature set with tools that are unneeded?</address><h2>Time frame</h2><p>ELMS LN is being designed and implemented with a goal of powering the next 10 years of innovative, free, open systems I seek to develop. &nbsp;To do this, I&#39;ve created several tools over the years to help bring me to this point. &nbsp;The most important currently is known as <a href=\"https://drupal.org/project/ulmus\" target=\"_blank\" title=\"Ulmus distro\">Ulmus</a>. &nbsp;It is a distribution that was specifically created to allow for the rapid creation of new tools to plug into ELMS learning network. &nbsp;Think of it as the framework of a tool with all the modules, connections and features required at a base-layer to enable a smooth transition into a course sub-net as a new tool. Web Services also help open the door for bringing non-drupal tools into scope of a traditionally all drupal network. &nbsp;RESTful APIs can be implemented by&nbsp;<strong>any system in any language,&nbsp;</strong>as well as <a href=\"https://drupal.psu.edu/content/learning-tools-interoperability-drupal\" target=\"_blank\" title=\"LTI and Drupal, why you should care\">the use of LTI to help bridge communications</a>. At the time of this writing, I am running the <a href=\"https://drupal.org/project/cis\" target=\"_blank\" title=\"CIS\">CIS</a>&nbsp;(online) and <a href=\"https://drupal.org/project/mooc\" target=\"_blank\" title=\"MOOC\">MOOC</a>&nbsp;(courses) distributions in production with several courses. &nbsp;If I had to rate them in terms of completion, I&#39;d say both are at about 95% stabilization and well on their way to being finalized systems with only minor UI, UX, and bug fixes to go. &nbsp;CIS&#39;s theme is still in active development as well as a professionally produced ELMS Learning Network Design Guide with detailed visual descriptions of the ELMS &quot;brand&quot;. &nbsp;Documentation needs a lot of love, but that&#39;s what things like this blog hope to help bridge! The ELMS: CLE (studio) distribution is available as a proof of concept and will receive full development focus over the next 4 months. Some additional distributions being developed in tandem with hopes of being released over the course of the next year include a centralized helpdesk, a centralized accessibility and copyright auditing system,&nbsp;<a href=\"https://drupal.org/project/remote_watchdog\" target=\"_blank\" title=\"Remote Watchdog\">a semi-centralized error reporting system</a>, a <a href=\"https://drupal.org/project/lar\" target=\"_blank\" title=\"LAR\">learning analytics repository</a> (lar) and an <a href=\"https://drupal.org/project/icor\" target=\"_blank\" title=\"ICOR\">interactive course object repository</a>&nbsp;(icor).</p>",
    "image":"/data/images/blog/cis-connected.jpg",
    "largeImage":"/data/images/blog/cis-connected.jpg"
  }
]