[
  {
    "name":"Bryan+Ollendyke",
    "title":"Bryan Ollendyke",
    "category":"team",
    "price":50.20,
    "description":"Bryan is the project lead of ELMS Learning Network. Bryan is a graduate of the Pennsylvania State University College of Information, Sciences & Technology with a B.S. (2006) and M.S. (2015). His Master's Thesis of Information Altruism highlights that through donation of information technology we are able to change institutions. He has been contributing to Drupal based systems since 2007 and is a tireless advocate for the transformative nature of open source communities. Bryan is a leading voice in the Drupal in Education community and has helped Penn State adopt and grow a vibrant Drupal community. Presenting at dozens of Education and Drupal conferences alike, Bryan travels with his message that open source can, does, and will transform our institutions and our world. The world needs more dreamers, bring dreams to life with us!",
    "image":"/data/images/team/btopro.jpg",
    "largeImage":"/data/images/team/btopro.jpg"
  },
  {
    "name":"Michael+Potter",
    "title":"Michael Potter",
    "category":"team",
    "price":22.15,
    "description":"You'll be swooning over this crew neck as soon as you feel how soft it is.&amp;nbsp;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Features:&lt;/div&gt;&lt;div&gt;&lt;ul&gt;&lt;li&gt;40% preshrunk ring-spun cotton, 60% polyester terry fleece.&amp;nbsp;&lt;/li&gt;&lt;li&gt;Available in dark heather charcoal with the white Google logo screen printed across center chest.&lt;/li&gt;&lt;/ul&gt;&lt;/div&gt;",
    "image":"/data/images/team/heymp.jpg",
    "largeImage":"/data/images/team/heymp.jpg"
  },
  {
    "name":"Michael+Collins",
    "title":"Michael Collins",
    "category":"team",
    "price":45.65,
    "description":"Ultra soft. Ultra cozy. Our popular flex fleece hoodie now available in speckled green.&amp;nbsp;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Features:&lt;/div&gt;&lt;div&gt;&lt;ul&gt;&lt;li&gt;50% cotton / 50% polyester.&amp;nbsp;&lt;/li&gt;&lt;li&gt;Made in the USA.&amp;nbsp;&lt;/li&gt;&lt;li&gt;Full-zip.&amp;nbsp;&lt;/li&gt;&lt;li&gt;Available in green with specks of blue and the white Google logo embroidered at left bicep.&amp;nbsp;&lt;/li&gt;&lt;/ul&gt;&lt;/div&gt;",
    "image":"/data/images/team/michael_collins.png",
    "largeImage":"/data/images/team/michael_collins.png"
  },
    {
    "name":"Katrina+Wehr",
    "title":"Katrina Wehr",
    "category":"team",
    "price":32.35,
    "description":"Stay warm in this cozy hoodie made of 50% cotton and 50% polyester. This comfortable design features set in sleeves, dyed to match draw cord and a front pouch pocket. Available in Charcoal with the full color YouTube logo screen printed across the chest. Unisex sizing.",
    "image":"/data/images/team/katrina_wehr.jpg",
    "largeImage":"/data/images/team/katrina_wehr.jpg"
  },
  {
    "name":"Mark+Milutinovic",
    "title":"Mark Milutinovic",
    "category":"team",
    "price":33.60,
    "description":"Pack. Pack. Pack it up! This nylon jacket with reflective trim can literally be packed into itself in seconds. Features a waterproof nylon fabric, Android eyes &amp;amp; antennaes on the hood and a  carrying strap when jacket is fully packed. Android robot is printed on back above zipper in a reflective, metallic finish.",
    "image":"/data/images/team/mmilutinovic1313.jpg",
    "largeImage":"/data/images/team/mmilutinovic1313.jpg"
  },
  {
    "name":"Patrick+OConnor",
    "title":"Patrick O'Connor",
    "category":"team",
    "price":38.85,
    "description":"Cozy up with this full-zip hoodie.&amp;nbsp;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Features:&lt;/div&gt;&lt;div&gt;&lt;ul&gt;&lt;li&gt;60% combed, ring-spun cotton, 40% polyester.&lt;/li&gt;&lt;li&gt;Unisex sizing.&lt;/li&gt;&lt;li&gt;Retail fit.&lt;/li&gt;&lt;li&gt;Contrast zipper.&lt;/li&gt;&lt;li&gt;Kangaroo pockets with ribbed cuffs and waistband.&lt;/li&gt;&lt;li&gt;Available in dark heather with the white Google logo embroidered at left chest.&lt;/li&gt;&lt;/ul&gt;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;",
    "image":"/data/images/team/proconnor.jpg",
    "largeImage":"/data/images/team/proconnor.jpg"
  },
  {
    "name":"Melissa+Hicks",
    "title":"Melissa Hicks",
    "category":"team",
    "price":200.00,
    "description":"The ultimate in fit and fabric, this Vastrm hoodie doesn't disappoint. Made from soft pique fabric, the lightweight full-zip features a halfmoon accent and matching hoodie strings.&amp;nbsp;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Additional Features:&lt;/div&gt;&lt;div&gt;&lt;ul&gt;&lt;li&gt;100% cotton.&lt;/li&gt;&lt;li&gt;Hidden phone pocket neatly cradles your digital device.&amp;nbsp;&lt;/li&gt;&lt;li&gt;Available in charcoal grey with red strings and hood. White Google logo is embroidered at left bicep.&lt;/li&gt;&lt;/ul&gt;&lt;/div&gt;",
    "image":"/data/images/team/melissa.jpg",
    "largeImage":"/data/images/team/melissa.jpg"
  },
  {
    "name":"Rick+Humphries",
    "title":"Rick Humphries",
    "category":"team",
    "price":60.95,
    "description":"Rick is the Head of Digital Strategy at Buttercups Training, a UK-based training provider for pharmacy qualifications. Having graduated from The University of Nottingham with something that said he was OKish at Biochemistry, and recognising how terrible the course lecture experience was, Rick set about studying for a Postgraduate Diploma in Online and Distance Education so he could try to find a better way. The result was a decade long struggle to learn coding languages, design software, web technologies, data analysis and research techniques from scratch in an attempt to design course experiences that took into account emerging <strike>pedagogigoies</strike> education theories for online learning. Already a supporter of open source, in 2014 he stumbled across ELMS:LN and instantly resonated with the flexibility and potential of not only being able to build the course content, but also the learning tools themselves. He now uses ELMS:LN to power the learning experience of over 50,000 students and regularly contributes thoughts, ideas and bug reports to the issue queue while the rest of the ELMS:LN team are sleeping. He does this whilst drinking tea, eating crumpets and watching football (the proper sport), obviously.",
    "image":"/data/images/team/rick.png",
    "largeImage":"/data/images/team/rick.png"
  },
  {
    "name":"Brad+Fisher",
    "title":"Brad Fisher",
    "category":"team",
    "price":60.85,
    "description":"Brad is a solutions architect, a Drupal site builder and backend developer. With a healthy knowledge of 'ground-up' application deployment and system infrastructure, Brad likes to give projects a good home. At Penn State Brad works as a programmer/analyst, specializing in Drupal and Server automation.",
    "image":"/data/images/team/bradallenfisher.jpg",
    "largeImage":"/data/images/team/bradallenfisher.jpg"
  },
  {
    "name":"Kate+Camplese",
    "title":"Kate Camplese",
    "category":"team",
    "price":48.00,
    "description":"Kitt Camplese has served as a Senior Instructional Designer in the eLearning Design and Innovation Group (eLDIG) within Smeal College of Business, at The Pennsylvania State University since 2007. Kitt has been with Penn State University since 2003 and during this time she has established herself as an innovative learning designer, often working on many interesting and engaging courses. In her current role, she provides support to her team, manages the team’s course portfolio, and works with faculty to design and develop online and blended courses. Kitt believes learning that is designed using pedagogic theories and best practices, along with integrated technologies to enhance learning, delivered in the appropriate learning environment fosters engagement and collaboration, which results in improved student outcomes.",
    "image":"/data/images/team/kate_camplese.jpg",
    "largeImage":"/data/images/team/kate_camplese.jpg"
  },
  {
    "name":"Matt+Mooney",
    "title":"Matt Mooney",
    "category":"team",
    "price":37.75,
    "description":"Matt is the Director of Instructional Design for the Smeal College of Business at Penn State University. Prior to that, I was a faculty member/Assistant Professor of Educational Technology or Web and Interactive Media. He is a hard-core Mac user/evangilist, an experienced interactive media creator, author, occasional musician, and an award-winning college instructor. He has a Ph.D. in Curriculum and Instruction with a focus in Educational Technology from Purdue University, and an M.A. in Interpersonal Communication and a B.A.A. in Organizational Communication and Human Sexuality from Central Michigan University. Matt has had an interesting career path that has included private consulting, university administration, training, and his real love which is teaching in the college classroom.",
    "image":"/data/images/team/mooney.jpg",
    "largeImage":"/data/images/team/mooney.jpg"
  },
  {
    "name":"Renee+Ford",
    "title":"Renee Ford",
    "category":"team",
    "price":50.20,
    "description":"Renee Ford joined Penn State’s Smeal College of Business in 2012 and has worked as an instructional designer and instructor at Penn State since 2007. She has a background in education, human resource development, and organization development and is passionate about design, innovation, and educational equity. Renee believes that teaching and learning experiences, when designed well, provide opportunities for students and instructors to participate in excellent, engaging learning experiences that meet the needs of diverse learners.",
    "image":"/data/images/team/rjf227.jpg",
    "largeImage":"/data/images/team/rjf227.jpg"
  },
  {
    "name":"Cody+Goddard",
    "title":"Cody Goddard",
    "category":"team",
    "price":52.20,
    "description":"Cody works for the College of Arts & Architecture as an arts and education multimedia developer. His broad background in the arts and focused skills in still photography and videography allow him to communicate clearly and with intention. He has worked as a collaborator on a number of major art installations and projects, and works with faculty to develop courses for the eLearning Institute at Penn State.",
    "image":"/data/images/team/cody_goddard.jpg",
    "largeImage":"/data/images/team/cody_goddard.jpg"
  },
  {
    "name":"Charles+Lavera",
    "title":"Charles Lavera",
    "category":"team",
    "price":45.65,
    "description":"Charles Lavera is a Multimedia Specialist / Web Developer with the Office of Digital Learning (ODL) at the Eberly College of Science.  He upholds a broad background in digital-media and web-development with a focus on Drupal-based installations and open-source learning. Outside of the office, Charles is known for being a loving husband, dedicated musician, and a dependable friend.",
    "image":"/data/images/team/charles_lavera.png",
    "largeImage":"/data/images/team/charles_lavera.png"
  },
  {
    "name":"Jacquard-Knit+Full-Zip+Fleece",
    "title":"Jacquard-Knit Full-Zip Fleece",
    "category":"mens_outerwear",
    "price":74.90,
    "description":"We love color contrast, especially in Google Blue! This textured jacket features a jacquard texture with contrast stitching and zippers.&amp;nbsp;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Additional Features:&lt;/div&gt;&lt;div&gt;&lt;ul&gt;&lt;li&gt;100% polyester.&amp;nbsp;&lt;/li&gt;&lt;li&gt;Audio port access available on inside left pocket.&lt;/li&gt;&lt;li&gt;Available in Carbon/Olympic Blue with the Google logo embroidered in white on left chest.&lt;/li&gt;&lt;/ul&gt;&lt;/div&gt;",
    "image":"/data/images/10-14217B.jpg",
    "largeImage":"/data/images/10-14217A.jpg"
  },
  {
    "name":"YouTube+Unisex+Flex+Fleece+Zip+Hoodie",
    "title":"YouTube Unisex Flex Fleece Zip Hoodie",
    "category":"mens_outerwear",
    "price":45.25,
    "description":"Our popular flex fleece hoodie, now for YouTube fans everywhere.&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Features:&lt;/div&gt;&lt;div&gt;&lt;ul&gt;&lt;li&gt;50% polyester, 50% cotton fleece.&lt;/li&gt;&lt;li&gt;Sporty, unisex fit.&lt;/li&gt;&lt;li&gt;Metal zipper.&lt;/li&gt;&lt;li&gt;Hood.&lt;/li&gt;&lt;li&gt;Available in dark heather grey with the YouTube logo embroidered at left bicep.&lt;/li&gt;&lt;/ul&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;/div&gt;",
    "image":"/data/images/10-15103B.jpg",
    "largeImage":"/data/images/10-15103A.jpg"
  }
]
